{"Current": [{"date": "October 24, 2016", "text": ["You are given a positive integer \\(n\\) and a matrix \\(A_n \\in M_n(\\mathbb{F}_2)\\) (i.e., \\(A_n\\) is an \\(n \\times n\\) matrix whose entries are integers modulo 2) which contains all ones on and above the main diagonal and zeros elsewhere. For example,", "$$A_3 = \\begin{pmatrix} 1 & 1 & 1 \\\\ 0 & 1 & 1 \\\\ 0 & 0 & 1 \\end{pmatrix}.$$", "Find the order of \\(A_n\\) under multiplication as a function of \\(n\\). Equivalently, find the smallest positive integer \\(k\\) such that \\(A_n^k = I\\) the identity matrix. For example, the order of \\(A_2\\) is 2 since \\(A_2^2 = \\begin{pmatrix} 1 & 1 \\\\ 0 & 1 \\end{pmatrix}^2 = \\begin{pmatrix} 1 & 0 \\\\ 0 & 1 \\end{pmatrix} \\)."], "name": "Matrix Powers", "img": ""}, {"date": "October 04, 2016", "text": ["3 squares are placed side by side to form a horizontal \\(1\\) by \\(3\\) grid. Label the squares from left to right as \\(a\\), \\(b\\), and \\(c\\). A frog is placed at square \\(a\\). The frog will hop between squares according to following rules. When on square \\(a\\), it hops to be \\(b\\) with probability \\(\\frac{2}{3}\\) and otherwise stays on \\(a\\). When on square \\(b\\), it hops to \\(a\\) with probability \\(\\frac{1}{2}\\) and otherwise hops to \\(c\\). Once on square \\(c\\), the frog stops its bizarre hopping patterns. What is the expected number of hops for the frog to travel from square \\(a\\) to square \\(c\\)?"], "name": "How Many Hops Does the Frog Take?", "img": ""}], "Past": [{"date": "April 25, 2016", "text": ["You're getting ready to play blackjack in which you have a 40% chance of winning a single game. In this version of blackjack, if you bet \\(B\\) dollars and win, you win back your bet amount (So if you start with $10 of which you bet $2 and win, then you will receive $4 back, bringing your total to $12). On the other hand, if you lose the game, then you lose your bet amount.", "You decide to employ a certain strategy, but you would like to determine its optimality before you test it out. The strategy is as follows. You pick a bet amount \\(B\\) and bet this amount in each game you play. If you start with \\(T\\) total dollars and begin playing a series of games, as soon as your total becomes \\(T + B\\), you stop playing and cash out with \\(B\\) dollars in profit.", "What is the probability that, as the number of games you play tends to infinity, you end up cashing out using the above strategy? You may assume that you can go into debt while playing the game (i.e., if you lose all of your \\(T\\) dollars, you may continue betting, perhaps by taking out a loan)."], "name": "Bets", "img": ""}, {"date": "April 12, 2016", "text": ["You have a \\( 3 \\times n \\) board which has \\( 3 \\) rows and \\( n \\) columns. You are allowed to place tiles on this board that are either \\( 3 \\times 1 \\), \\( 2 \\times 1 \\), or \\( 1 \\times 2 \\). How many ways are there to fill this board with these tiles? (Note: a \\(3 \\times 1\\) tile is indistinguishable from another \\(3 \\times 1\\) tile and similarly for the other tiles)."], "name": "Tiles", "img": "./img/tile.png"}, {"date": "April 05, 2016", "text": ["Given an arbitray quadrilateral \\(ABCD\\), take the midpoints of each side, \\(AB \\rightarrow E\\), \\(BC \\rightarrow F\\), \\(CD \\rightarrow G\\), \\(DA \\rightarrow H\\). Now, construct the quadrilateral \\(EFGH\\).", "Prove that \\(EFGH\\) is always a parallelogram."], "name": "Midpoint Parallelogram", "img": "./img/midpoint.png"}, {"date": "March 30, 2016", "text": ["Prove that for any positive integer \\(a\\) which is <strong>not</strong> divisible by 7, \\(a^3\\) leaves remainder either 1 or 6 when divided by 7."], "name": "Sevens", "img": ""}, {"date": "March 22, 2016", "text": ["A conical funnel with radius \\(r\\) inches and height \\(2r\\) inches is filled completely with water and is held above a hemi-spherical bowl with radius \\(r\\) inches. If we allow the funnel to drain water into the bowl until the height of the water in the funnel is 1 inch, for what value of \\(r\\) is the height of the water in the bowl also 1 inch?"], "name": "Water", "img": "./img/water.png"}, {"date": "March 1, 2016", "text": ["Jonah, Siddy, Rafael, Sarah and Ericka bought a large jar of cookies to share among eachother. After eating, there was one cookie left, and they decided to leave it for their friend Dan. But when Dan went to eat this leftover cookie, he discovered that someone else already ate it! Dan knows that his 5 friends are each telling one truth and one lie:", "<ul>", "<li>Jonah says, <em>\"It wasn't Ericka. It was Siddy.\"</em></li>", "<li>Siddy says, <em>\"It wasn't Rafael. It wasn't Ericka.\"</em></li>", "<li>Rafael says, <em>\"It was Ericka. It wasn't Jonah.\"</em></li>", "<li>Sarah says, <em>\"It was Rafael. It was Siddy.\"</em></li>", "<li>Ericka says, <em>\"It was Sarah. It wasn't Jonah.\"</em></li>", "</ul>", "Who ate the last cookie?"], "name": "Cookies"}, {"date": "February 16, 2016", "text": ["Find the value of this summation.", "$$\\sum_{n = 3}^{\\infty} \\frac{n^2 - 3n - 9}{n^4 + 9n^2 + 81}$$", "To get credit for this one, you must show how you derive your answer!"], "name": "Poly Sum"}, {"date": "February 9, 2016", "text": ["A cook has 3 cherry tomatoes, 4 pieces of chicken, and 5 pieces of onion that she wishes to place on a skewer to make a kabob. She places the food on the skewer in random order, each arrangement being equally likely. Let \\(\\frac{a}{b}\\) in lowest terms be the probability that no two pieces of onion are next to one another. Find \\(a + b\\).", "To get credit for this one, you must show how you derive your answer!"], "name": "Kabobs"}, {"date": "October 27, 2015", "text": ["Do you think you can solve this integral?", "$$\\int_{-\\infty}^{\\infty}\\frac{\\sin{(x)}}{x}dx$$", "To get credit for this one, you must show how you derive your answer!"], "name": "Crazy Integral"}, {"date": "November 3, 2015", "text": ["Mara and John enjoy using a catapult to fling pumpkins at their neighbors' car. Independently of each other, Mara has a \\(\\frac{5}{7}\\) chance of hitting the car on a single fling while John has a \\(\\frac{2}{5}\\) chance of doing the same.", "If Mara and John fling pumpkins at the same rate and start at the same time, what is the probability that John will take less throws than Mara to hit their neighbors' car?"], "name": "Pumpkins"}]}